RadiodditySmartMaker/firmware/variants/nrf52840/nodara/variant.h
/*
 Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
 Copyright (c) 2016 Sandeep Mistry All right reserved.
 Copyright (c) 2018, Adafruit Industries (adafruit.com)

 This library is free software; you can redistribute it and/or
 modify it under the terms of the GNU Lesser General Public
 License as published by the Free Software Foundation; either
 version 2.1 of the License, or (at your option) any later version.
 This library is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 See the GNU Lesser General Public License for more details.
 You should have received a copy of the GNU Lesser General Public
 License along with this library; if not, write to the Free Software
 Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_NODARA_NRF52840_
#define _VARIANT_NODARA_NRF52840_

// ---------------------------------------------------------------------------
// Master clock
// ---------------------------------------------------------------------------
#define VARIANT_MCK (64000000ul)

// ---------------------------------------------------------------------------
// Low-frequency clock source — board has 32.768 kHz external crystal
// ---------------------------------------------------------------------------
#define USE_LFXO

// ---------------------------------------------------------------------------
// WVariant.h (Adafruit nRF52 core)
// ---------------------------------------------------------------------------
#include "WVariant.h"

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

// ---------------------------------------------------------------------------
// Pin count — nRF52840 has P0 (0–31) + P1 (32–47)
// ---------------------------------------------------------------------------
#define PINS_COUNT (48)
#define NUM_DIGITAL_PINS (48)
#define NUM_ANALOG_INPUTS (1)
#define NUM_ANALOG_OUTPUTS (0)

// ===========================================================================
// Feature presence flags
// ===========================================================================
#define HAS_RADIO       1           // LoRa RA-01S (SX1262)
#define HAS_GPS         1           // GPS GP-02 (L76K)
#define HAS_SCREEN      1           // E-Ink GDEM0213B74 (SSD1680)
#define HAS_BUTTON      1           // 6-way F1..F6
#define HAS_RTC         1           // IIC

// ===========================================================================
// LEDs  (GPIO_ACTIVE_LOW, LED_STATE_ON = 0)
// ===========================================================================
#define PIN_LED1        (32 + 3)    // P1.03 red
#define PIN_LED2        (14 + 0)    // P0.14 green
#define PIN_LED3        (32 + 1)    // P1.01 blue

#define LED_STATE_ON    (LOW)

// ===========================================================================
// Buttons  (GPIO_PULL_UP | GPIO_ACTIVE_LOW)
// ===========================================================================
#define PIN_BTN_F1      (32 + 11)  // P1.11
#define PIN_BTN_F2      (0 + 9)    // P0.09  [NFC1]
#define PIN_BTN_F3      (0 + 6)    // P0.06
#define PIN_BTN_F4      (0 + 8)    // P0.08
#define PIN_BTN_F5      (0 + 10)   // P0.10  [NFC2]
#define PIN_BTN_F6      (0 + 11)   // P0.11

#define PIN_BTN_ACTIVE  (LOW)

// ===========================================================================
// External UART listen (RX-only) — P1.00 @ 1200 bps
// ===========================================================================
#define MCU_DATA_PIN        (32 + 0) // P1.00

// ---------------------------------------------------------------------------
// Adafruit core Serial2 (UART2) — MCU
// ---------------------------------------------------------------------------
#define PIN_SERIAL2_RX MCU_DATA_PIN
#define PIN_SERIAL2_TX (-1)

// ===========================================================================
// Battery ADC  — P0.04 (AIN2), 50:50 divider (×2)
// Power control — P0.15, active-high (HIGH = divider enabled)
// ===========================================================================
#define PIN_BATTERY_ADC     (0 + 4)    // P0.04 = AIN2
#define PIN_BATTERY_PWR     (0 + 15)   // P0.15  divider enable (active-high)

static const uint8_t A0 = PIN_BATTERY_ADC;

// ===========================================================================
// I2C bus — PCF8563 RTC (and future sensors)
// P0.26 = SDA, P0.27 = SCL, external pull-ups on PCB
// ===========================================================================
#define WIRE_INTERFACES_COUNT   1
#define PIN_WIRE_SDA            (0 + 26)  // P0.26
#define PIN_WIRE_SCL            (0 + 27)  // P0.27
#define PIN_RTC_INT             (0 + 16)  // Interrupt from the PCF8563 RTC

// ===========================================================================
// External Flash — PY25Q32 (planned)
// SPI: dedicated instance, shares no pins with SPI0/SPI1
// ===========================================================================
#define PIN_EXT_FLASH_SCK   (32 + 14)  // P1.14
#define PIN_EXT_FLASH_MOSI  (32 + 12)  // P1.12
#define PIN_EXT_FLASH_MISO  (32 + 13)  // P1.13
#define PIN_EXT_FLASH_CS    (32 + 15)  // P1.15  chip select (active-low)
#define PIN_EXT_FLASH_WP    (0 + 7)    // P0.7   write protect
#define PIN_EXT_FLASH_HOLD  (0 + 5)    // P0.5   hold

// QSPI Pins
#define PIN_QSPI_SCK (32 + 14)
#define PIN_QSPI_CS (32 + 15)
#define PIN_QSPI_IO0 (32 + 12) // MOSI if using two bit interface
#define PIN_QSPI_IO1 (32 + 13) // MISO if using two bit interface
#define PIN_QSPI_IO2 (0 + 7)   // WP if using two bit interface (i.e. not used)
#define PIN_QSPI_IO3 (0 + 5)   // HOLD if using two bit interface (i.e. not used)

// .pio/libdeps/nodara/SdFat - Adafruit Fork/src/SdFat.h:57:30: error:
#ifndef SS
#define SS PIN_QSPI_CS
#endif

// On-board QSPI Flash
#define EXTERNAL_FLASH_DEVICES P25Q32
#define EXTERNAL_FLASH_USE_QSPI     // Disabled for power comparison test

