RadiodditySmartMaker/firmware/variants/nrf52840/nodara/variant.h
// ===========================================================================
// LoRa — Ai-Thinker RA-01S (SX1262)
// SPI bus: SPI0 (SPIM0 / default SPI)
// ===========================================================================
#define PIN_LORA_PWR    (0 + 13)   // P0.13  LDO enable (active-high)
#define PIN_LORA_SCK    (0 + 19)   // P0.19
#define PIN_LORA_MOSI   (0 + 22)   // P0.22
#define PIN_LORA_MISO   (0 + 23)   // P0.23
#define PIN_LORA_CS     (0 + 24)   // P0.24  chip select (active-low)
#define PIN_LORA_RST    (0 + 25)   // P0.25  reset (active-low)
#define PIN_LORA_BUSY   (0 + 17)   // P0.17  busy output (active-high)
#define PIN_LORA_DIO1   (0 + 20)   // P0.20  TX/RX done IRQ (active-high)
#define PIN_LORA_DIO3   (0 + 21)

// ---------------------------------------------------------------------------
// Adafruit core SPI0 (default SPI) — LoRa
// ---------------------------------------------------------------------------
#define PIN_SPI_MISO    PIN_LORA_MISO
#define PIN_SPI_MOSI    PIN_LORA_MOSI
#define PIN_SPI_SCK     PIN_LORA_SCK

// static const uint8_t SS   = PIN_LORA_CS;
// static const uint8_t MOSI = PIN_LORA_MOSI;
// static const uint8_t MISO = PIN_LORA_MISO;
// static const uint8_t SCK  = PIN_LORA_SCK;

// ===========================================================================
// E-Ink — GDEM0213B74 (SSD1680, 2.13", 250×122)
// SPI bus: SPI1 (SPIM2, dedicated write-only)
//
// PIN_EINK_POWER controls the panel power LDO.  EINK_POWER_ACTIVE defines
// the active level (LOW = panel ON, HIGH = panel OFF for PCB v2).
// Note: PIN_EINK_EN is deliberately NOT defined — this board uses the
// PIN_EINK_POWER / EINK_POWER_ACTIVE pair instead.
// ===========================================================================
#define PIN_EINK_POWER  (32 + 10)  // P1.10  panel LDO enable
#define PIN_EINK_SCLK   (0 + 31)   // P0.31
#define PIN_EINK_MOSI   (0 + 29)   // P0.29
#define PIN_EINK_CS     (0 + 30)   // P0.30  chip select (active-low)
#define PIN_EINK_DC     (0 + 28)   // P0.28  data/command (HIGH=data, LOW=cmd)
#define PIN_EINK_RES    (0 + 2)    // P0.2   reset (active-low, idle HIGH)
#define PIN_EINK_BUSY   (0 + 3)    // P0.3   busy output (active-high)

#define EINK_POWER_ACTIVE (LOW)    // LOW = panel power ON

// ---------------------------------------------------------------------------
// Adafruit core SPI1 — E-Ink (write-only, MISO unused)
// ---------------------------------------------------------------------------
#define PIN_SPI1_MISO   (-1)
#define PIN_SPI1_MOSI   PIN_EINK_MOSI
#define PIN_SPI1_SCK    PIN_EINK_SCLK

// ===========================================================================
// GPS — Ai-Thinker GP-02 (L76K compatible, NMEA 9600 bps)
// UART: Serial1 (UART1, P1.08/P1.09)
// ===========================================================================
#define PIN_GNSS_TX     (32 + 8)   // P1.08  nRF UART TX → GP-02 RX
#define PIN_GNSS_RX     (32 + 9)   // P1.09  nRF UART RX ← GP-02 TX
#define PIN_GNSS_RST    (32 + 5)   // P1.05  hard reset (active-high via NPN)
#define PIN_GNSS_PWR    (0 + 12)   // P0.12  LDO enable (active-high)
#define PIN_GNSS_STBY   (32 + 7)   // P1.07  standby (active-low; HIGH=normal)
#define PIN_GNSS_PPS    (32 + 4)   // P1.04  pulse-per-second output
#define PIN_GNSS_REGION (32 + 2)   // P1.02  constellation selection

#define GNSS_PWR_ACTIVE  (HIGH)
#define GNSS_STBY_ACTIVE (LOW)

// ---------------------------------------------------------------------------
// Adafruit core Serial1 (UART1) — GPS
// ---------------------------------------------------------------------------
#define PIN_SERIAL1_RX  PIN_GNSS_RX
#define PIN_SERIAL1_TX  PIN_GNSS_TX

// ===========================================================================
// SPI bus count
//   0 = SPI0  (SPIM0) — LoRa
//   1 = SPI1  (SPIM2) — E-Ink
//   2 = SPI3  (SPIM1) — Flash
// ===========================================================================
#define SPI_INTERFACES_COUNT    2

// ===========================================================================
// Serial port override — nRF52840 uses Serial (USB-CDC) for logging
// ===========================================================================
#define SERIAL_PRINT_PORT   0

// ===========================================================================
// Software configuration (module settings, feature exclusions, calibration…)
// ===========================================================================

// ---------------------------------------------------------------------------
// Enabled modules (explicitly not excluded)
// ---------------------------------------------------------------------------
#define MESHTASTIC_EXCLUDE_SIXKEYNAVINPUT   0   // 6-button polling driver
#define MESHTASTIC_EXCLUDE_I2C              0   // PCF8563 RTC on I2C
#define MESHTASTIC_EXCLUDE_POWER_FSM        0   // Required for BLE advertising

// ---------------------------------------------------------------------------
// NRF_APM: use nrfx_power_usbstatus_get() to detect USB VBUS state.
// Required for correct isPowered() / USB detection on nRF52840 without PMU.
// ---------------------------------------------------------------------------
#define NRF_APM

// ---------------------------------------------------------------------------
// USE_POWERSAVE: forces is_power_saving = true. Enable when bench-testing
// without a battery (ADC reads ~0 mV → false external-power detection).
// Battery IS connected on this board; keep commented.
// ---------------------------------------------------------------------------
// #define USE_POWERSAVE

// ---------------------------------------------------------------------------
// USE_SEGGER: redirect LOG_* output to SEGGER RTT (SWD/J-Link) instead of
// USB-CDC.  Enable when the device has no USB connected.
// ---------------------------------------------------------------------------
// #define USE_SEGGER

// ---------------------------------------------------------------------------
// BLE configuration
// ---------------------------------------------------------------------------
// #define USERPREFS_FIXED_BLUETOOTH   123456  // Fixed pairing PIN
// #define BLE_ADV_FAST_INTERVAL       800     // 800 × 0.625 ms = 500 ms
// #define BLE_ADV_SLOW_INTERVAL       1600    // 1600 × 0.625 ms = 1000 ms
// #define BLE_ADV_FAST_TIMEOUT_S      0       // Skip fast mode, use slow immediately

// ---------------------------------------------------------------------------
// No external sensors or motion hardware
// ---------------------------------------------------------------------------
#define MESHTASTIC_EXCLUDE_ENVIRONMENTAL_SENSOR        1
#define MESHTASTIC_EXCLUDE_ENVIRONMENTAL_SENSOR_EXTERNAL 1
#define MESHTASTIC_EXCLUDE_POWER_TELEMETRY             1
#define MESHTASTIC_EXCLUDE_AIR_QUALITY_SENSOR          1
#define MESHTASTIC_EXCLUDE_HEALTH_TELEMETRY            1
#define MESHTASTIC_EXCLUDE_ACCELEROMETER               1
#define MESHTASTIC_EXCLUDE_DETECTIONSENSOR             1

// ---------------------------------------------------------------------------
// No audio
// ---------------------------------------------------------------------------
#define MESHTASTIC_EXCLUDE_AUDIO            1

// ---------------------------------------------------------------------------
// No BLE PAX counting
// ---------------------------------------------------------------------------
#define MESHTASTIC_EXCLUDE_PAXCOUNTER       1

// ---------------------------------------------------------------------------
// No peripheral notification module
// ---------------------------------------------------------------------------
#define MESHTASTIC_EXCLUDE_EXTERNALNOTIFICATION 1

// ---------------------------------------------------------------------------
// Unused features and network modules
// ---------------------------------------------------------------------------
#define MESHTASTIC_EXCLUDE_MQTT             1   // nRF52 has no WiFi
#define MESHTASTIC_EXCLUDE_SERIAL           1   // Serial bridge module
#define MESHTASTIC_EXCLUDE_STOREFORWARD     1   // RAM-heavy, not needed
#define MESHTASTIC_EXCLUDE_DROPZONE         1   // File sharing
#define MESHTASTIC_EXCLUDE_ATAK             1   // ATAK integration
#define MESHTASTIC_EXCLUDE_REPLYBOT         1   // Auto-reply bot
#define MESHTASTIC_EXCLUDE_REMOTEHARDWARE   1   // Remote GPIO control
#define MESHTASTIC_EXCLUDE_POWERSTRESS      1   // Stress-test tool

// ---------------------------------------------------------------------------
// Role assignments
// ---------------------------------------------------------------------------
#define LED_POWER       PINS_COUNT      // NULL
#define LED_USB         PIN_LED2        // green: USB connected / charge complete
#define LED_PAIRING     PIN_LED3        // blue: BLE pairing / connected

