RadiodditySmartMaker/firmware/variants/nrf52840/nodara/variant.h
// Legacy Bluefruit color aliases (do not match physical LED colors)
#define LED_RED         PIN_LED1
#define LED_BLUE        PIN_LED3
#define LED_GREEN       PIN_LED2
#define LED_CONN        LED_PAIRING

// ---------------------------------------------------------------------------
// SixKeyNavInput expects these names
// ---------------------------------------------------------------------------
#define PIN_BUTTON_RIGHT   PIN_BTN_F3
#define PIN_BUTTON_DOWN    PIN_BTN_F4
#define PIN_BUTTON_LEFT    PIN_BTN_F2
#define PIN_BUTTON_FN      PIN_BTN_F5
#define PIN_BUTTON_ENTER   PIN_BTN_F6
#define PIN_BUTTON_UP      PIN_BTN_F1

// ---------------------------------------------------------------------------
// Radio module selection
// The RA-01S physically contains an SX1268 (China-band); its register map is
// identical to SX1262.  USE_SX1262 is correct — do NOT use USE_SX1268.
// ---------------------------------------------------------------------------
#define USE_SX1262

// ---------------------------------------------------------------------------
// Framework pin aliases (SX126xInterface constructor args)
// ---------------------------------------------------------------------------
#define SX126X_CS      PIN_LORA_CS
#define SX126X_DIO1    PIN_LORA_DIO1
#define SX126X_RESET   PIN_LORA_RST
#define SX126X_BUSY    PIN_LORA_BUSY
#define SX1262_DIO3    PIN_LORA_DIO3

// ---------------------------------------------------------------------------
// TCXO — NOT present on RA-01S (crystal oscillator variant).
// Do NOT define SX126X_DIO3_TCXO_VOLTAGE.
// (Uncomment only for RA-01SH which has a TCXO.)
// ---------------------------------------------------------------------------
// #define SX126X_DIO3_TCXO_VOLTAGE  1.8
// #define TCXO_OPTIONAL

// ---------------------------------------------------------------------------
// Power enable — RA-01S LDO on P0.13 (active-high)
// ---------------------------------------------------------------------------
#define SX126X_POWER_EN   PIN_LORA_PWR

// ---------------------------------------------------------------------------
// RF switch — RA-01S uses DIO2 internally for TX/RX antenna switching
// No external MCU pin required; RadioLib handles it via SetDio2AsRfSwitchCtrl.
// ---------------------------------------------------------------------------
#define SX126X_DIO2_AS_RF_SWITCH

// ---------------------------------------------------------------------------
// Maximum TX power (dBm)
// ---------------------------------------------------------------------------
#define SX126X_MAX_POWER  22

// ---------------------------------------------------------------------------
// Framework pin aliases
// ---------------------------------------------------------------------------
#define GPS_RX_PIN       PIN_GNSS_RX
#define GPS_TX_PIN       PIN_GNSS_TX
#define PIN_GPS_RESET    PIN_GNSS_RST
#define PIN_GPS_EN       PIN_GNSS_PWR
#define PIN_GPS_STANDBY  PIN_GNSS_STBY
#define PIN_GPS_PPS      PIN_GNSS_PPS

#define GPS_EN_ACTIVE      GNSS_PWR_ACTIVE
#define GPS_STANDBY_ACTIVE GNSS_STBY_ACTIVE

// ---------------------------------------------------------------------------
// Baud rate — GP-02 default is 9600 bps (matches Meshtastic framework default)
// Only define GPS_BAUDRATE if a non-default rate is needed.
// ---------------------------------------------------------------------------
// #define GPS_BAUDRATE  9600

// ---------------------------------------------------------------------------
// Panel model
// GxEPD2_213_B74: driver specifically for GDEM0213B74 (SSD1680).
// Uses the OTP built-in LUT for partial updates — correct for this panel.
// Physical: WIDTH=128 gate lines, HEIGHT=250 source lines.
// After setRotation(3): display coordinate width=250, height=128.
// ---------------------------------------------------------------------------
#define EINK_DISPLAY_MODEL  GxEPD2_213_B74
#define EINK_WIDTH          250   // display width  after rotation-3 (source lines)
#define EINK_HEIGHT         122   // display height after rotation-3 (visible gate lines)

// ---------------------------------------------------------------------------
// Screen rotation
//   0 → 250w × 122h  landscape, FPC at bottom
//   1 → 122w × 250h  portrait
//   2 → 250w × 122h  landscape, FPC at top (180°)
//   3 → 122w × 250h  portrait, rotated 180°
// ---------------------------------------------------------------------------
#define EINK_ROTATION   3

// ---------------------------------------------------------------------------
// Dynamic refresh control
// ---------------------------------------------------------------------------
#define EINK_LIMIT_FASTREFRESH      (20)
#define EINK_LIMIT_GHOSTING_PX      (EINK_WIDTH * EINK_HEIGHT / 2)
#define EINK_BACKGROUND_USES_FAST
#define EINK_HASQUIRK_GHOSTING

// ---------------------------------------------------------------------------
// ADC input pin (must match PIN_BATTERY_ADC in variant.h)
// ---------------------------------------------------------------------------
#define BATTERY_PIN                     PIN_BATTERY_ADC // P0.04 = AIN2 (Arduino pin 4)
#define ADC_MULTIPLIER                  2.0f            // 50:50 divider: V_batt = V_adc × 2
#define BATTERY_SENSE_RESOLUTION_BITS   12
#define BATTERY_SENSE_RESOLUTION        4096.0
#define VBAT_AR_INTERNAL                AR_INTERNAL_3_0

// ---------------------------------------------------------------------------
// Voltage-divider power-enable (active-high)
// P0.15 = Arduino pin 15.
// Power.cpp guards every analogRead() burst with adcEnable/adcDisable.
// ---------------------------------------------------------------------------
#define ADC_CTRL            PIN_BATTERY_PWR     // P0.15
#define ADC_CTRL_ENABLED    HIGH                // active-high

// ---------------------------------------------------------------------------
// ADC reference voltage
// Adafruit nRF52 BSP configures SAADC with internal 0.6 V reference
// and 1/6 gain → full-scale = 0.6 V / (1/6) = 3.6 V.
// Using 3.3 would cause a systematic ~9 % under-read.
// ---------------------------------------------------------------------------
#define AREF_VOLTAGE        3.0

// ---------------------------------------------------------------------------
// OCV (Open-Circuit Voltage) discharge curve — standard single-cell LiPo
// Values in mV, ordered 100 % → 0 % SOC (11 equally-spaced points).
// ---------------------------------------------------------------------------
#define NUM_OCV_POINTS  11
#define OCV_ARRAY       4190, 4050, 3990, 3890, 3800, 3720, 3630, 3530, 3420, 3300, 3100
#define NUM_CELLS       1

// ---------------------------------------------------------------------------
// PCF8563 I2C address
// Enables the PCF8563_RTC branch in ScanI2CTwoWire.cpp + RTC.cpp:
//   - readFromRTC(): reads datetime → RTCQualityDevice on boot
//   - perhapsSetRTC(): writes datetime back when GPS/NTP improves quality
// ---------------------------------------------------------------------------
#define PCF8563_RTC  0x51


#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* _VARIANT_NODARA_NRF52840_ */
